FV2310/E_1004.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Sperrprozesse Gas</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">19.3.1: AD: Wiederherstellung der Anschlussnutzung (Entsperren) auf Anweisung des LF</FONT></B><BR/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_1004</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde die Sperrung durch den UC "Unterbrechung der Anschlussnutzung (Sperren)<BR align="left"/>auf Anweisung des LF" ausgelöst?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation wurde nicht über den UC (Unterbrechung der Anschlussnutzung (Sperren) auf Anweisung des LF) gesperrt.<BR align="left"/>Hinweis: Die Entsperrung muss auf konventionellem Weg erfolgen.<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Wäre eine Wiederinbetriebnahme aufgrund eines technischen Verhinderungsgrundes<BR align="left"/>(z.B. entspricht nicht den geltenden Rechtsvorschriften, behördlichen<BR align="left"/>Verfügungen, den anerkannten Regeln der Technik, DVGW Technischen<BR align="left"/>Anschlussbedingungen (TAB) oder den sonstigen besonderen Vorschriften des NB)<BR align="left"/>nicht möglich?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster Ablehnung<BR align="left"/>Wiederinbetriebnahme wäre technisch nicht möglich<BR align="left"/>Hinweis:<BR align="left"/>Die Marktlokation bzw. die dazugehörigen elektrischen Anlagen kann gemäß NAV<BR align="left"/>und TAB nicht wieder in Betrieb genommen werden. Sie entspricht nicht der<BR align="left"/>geltenden Rechtsvorschriften und behördlichen Verfügungen sowie den anerkannten<BR align="left"/>Regeln der Technik, DVGW, den Technischen Anschlussbedingungen (TAB) und den<BR align="left"/>sonstigen besonderen Vorschriften des NB.<BR align="left"/></FONT>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Ist zum Zeitpunkt des Nachrichteneingangs die Marktlokation bereits gesperrt?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation ist nicht gesperrt.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Liegt bereits ein Entsperrauftrag vor?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Entsperrauftrag für die Marktlokation liegt bereits vor.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A05" [label="Nein"];
    "10" -> "20" [label="Ja"];
    "20" -> "A06" [label="Ja"];
    "20" -> "30" [label="Nein"];
    "30" -> "A01" [label="Nein"];
    "30" -> "40" [label="Ja"];
    "40" -> "A04" [label="Ja"];
    "40" -> "50" [label="Nein"];
    "50" -> "A99" [label="Ja"];
    "50" -> "A03" [label="Nein"];

    bgcolor="transparent";
}
